// lab15task3.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <stdio.h>

int main() {
//масив на 10 елементів
	int array[10], i;
//вивести дані про те що потрібно зробити користувачу
	printf("Enter 10 number:\n");
//вводимо десять елементів масиву
	for (i = 0; i < 10; i++) {
		scanf_s("%d", &array[i]);
	}
	//обнулення парних елементів
	for (i = 0; i < 10; i++) {
		if ((i + 1) % 2 == 0) {
			array[i] = 0;
	}
	}
// виводимо елементів масиву
	for (i = 0; i < 10; i++) {
		printf("%d", array[i]);
	}
	return 0;
}

